app/Http/Controllers/Karyawan/JadwalController.php

select `user_id` as `title`, `tanggal_mulai` as `start`, `shift_id` as `end` from `jadwal`
---
    public function index(Request $request)
    {

        $jadwal = Jadwal::select('user_id as title','tanggal_mulai as start','shift_id as end')->get();

select * from `shift` where `shift`.`id` in (1, 2)
select `tanggal_mulai`, `shift_id`, `user_id` from `jadwal`
---
    public function show($id)
    {
        $cek = Jadwal::with('shift','user')
        ->select('tanggal_mulai','shift_id','user_id')
        ->get();