app/Http/Controllers/Hrd/AbsensiController.php

    public function index(Request $request)
    {

        if (request()->ajax()) {

            $data = Absensi::with('shift','karyawan')
            ->select('id', 'user_id', 'tanggal', 'jam_masuk', 'jam_pulang', 'jam_lembur', 'shift_id')
            ->where('tanggal', '>=', $request->get('from'))
            ->where('tanggal', '<=', $request->get('to'))
            ->orderByDesc('tanggal');

            return Datatables::of($data->get())
                ->addIndexColumn()
                ->addColumn('tgl', function ($data) {
                    return date("d F Y", strtotime($data->tanggal));
                })
                ->addColumn('action', function ($data) {
                        $actionBtn = '
                                        <center>
                                        <a href="javascript:void(0)" class="btn btn-outline-primary btn-sm" data-toggle="tooltip" data-placement="top" title="Bayar" onclick="bayar(' . $data->id . ')"><i class="ti-money"></i></a>

                                        </center>';
                    return $actionBtn;
                })
                ->rawColumns(['tgl', 'action'])
                ->make(true);
---
select * from `karyawan` where `karyawan`.`id` in (1)
select * from `shift` where `shift`.`id` in (1)
select `id`, `user_id`, `tanggal`, `jam_masuk`, `jam_pulang`, `jam_lembur`, `shift_id` from `absensi` where `tanggal` >= '2022-04-01' and `tanggal` <= '2022-04-30' order by `tanggal` desc