app/Http/Controllers/Hrd/GajiController.php

    public function index()
    {

        //datatable
        if (request()->ajax()) {
            $data = Karyawan::with('user.jabatan')->get();

            return Datatables::of($data)
                ->addIndexColumn()
                ->addColumn('gaji', function ($data) {
                    return number_format($data->user->jabatan->gaji_pokok);
                })
                ->addColumn('action', function ($row) {

                    $actionBtn = '
                            <center>
                            <a href="/hrd/karyawan/'.$row->id.'/edit" class="btn btn-sm btn-outline-info" data-toggle="tooltip" data-placement="top" title="Slip Gaji"><i class="ti-money"></i></a>
                            <a href="javascript:void(0)" class="btn btn-sm btn-outline-warning" data-toggle="tooltip" data-placement="top" title="Edit" onclick="edit(' . $row->id . ')"><i class="ti-pencil-alt"></i></a>
                            <a href="javascript:void(0)" class="btn btn-sm btn-outline-danger" data-toggle="tooltip" data-placement="top" title="Hapus" onclick="delete_data(' . $row->id . ')"><i class="ti-trash"></i></a>
                            </center>';

                    return $actionBtn;
                })
                ->rawColumns(['action','gaji'])
                ->make(true);
        }

        $jabatan    = Jabatan::select('id', 'nama')->get();
---
select * from `jabatan` where `jabatan`.`id` in (1)
select * from `karyawan`
select * from `users` where `users`.`id` in (1, 2)
select `id`, `nama` from `jabatan`