app/Http/Controllers/Hrd/JadwalController.php

select * from `users` where `users`.`id` in (1, 2)
select * from `shift` where `shift`.`id` in (1)
select `id`, `user_id`, `tanggal_mulai`, `tanggal_selesai`, `shift_id` from `jadwal` where `tanggal_mulai` >= '2022-04-01' and `tanggal_selesai` <= '2022-04-30' order by `tanggal_mulai` desc
select * from `shift` where `shift`.`id` in (1, 2)
select `user_id`, `nama` from `karyawan`
select `id`, `nama` from `shift`
---
    public function index(Request $request)
    {

        if (request()->ajax()) {

            $data = Jadwal::with('shift','user')
            ->select('id', 'user_id', 'tanggal_mulai', 'tanggal_selesai', 'shift_id')
            ->where('tanggal_mulai', '>=', $request->get('from'))
            ->where('tanggal_selesai', '<=', $request->get('to'))
            ->orderByDesc('tanggal_mulai');

            return Datatables::of($data->get())
                ->addIndexColumn()
                ->addColumn('tgl_mulai', function ($data) {
                    return date("d F Y", strtotime($data->tanggal_mulai));
                })
                ->addColumn('tgl_selesai', function ($data) {
                    return date("d F Y", strtotime($data->tanggal_selesai));
                })
                ->addColumn('action', function ($data) {
                    $actionBtn = '
                        <center>
                        <a href="javascript:void(0)" class="btn btn-sm btn-link" data-toggle="tooltip" data-placement="top" title="Edit" onclick="edit(' . $data->id . ')"><i class="ti-pencil-alt"></i></a>
                        <a href="javascript:void(0)" class="btn btn-sm btn-link" data-toggle="tooltip" data-placement="top" title="Hapus" onclick="delete_data(' . $data->id . ')"><i class="ti-trash"></i></a>
                        </center>';
                    return $actionBtn;
                })
                ->rawColumns(['tgl_mulai','tgl_selesai','action'])
                ->make(true);
        }

        $user       = Karyawan::select('user_id', 'nama')->get();
        $shift      = Shift::select('id', 'nama')->get();

insert into `jadwal` (`user_id`, `shift_id`, `tanggal_mulai`, `tanggal_selesai`, `updated_at`, `created_at`) values ('2', '1', '2022-04-11', '2022-04-29', '2022-04-11 04:16:19', '2022-04-11 04:16:19')
---
    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'user_id'           => 'required',
            'shift_id'          => 'required',
            'tanggal_mulai'     => 'required',
            'tanggal_selesai'   => 'required',

        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => $validator->errors()]);
        }

        if($request->id){

            Jadwal::find($request->id)->update(
                [
                    'user_id'           => $request->user_id,
                    'shift_id'          => $request->shift_id,
                    'tanggal_mulai'     => $request->tanggal_mulai,
                    'tanggal_selesai'   => $request->tanggal_selesai,
                ]
            );

        }else{

            Jadwal::Create(
                [
                    'user_id'           => $request->user_id,
                    'shift_id'          => $request->shift_id,
                    'tanggal_mulai'     => $request->tanggal_mulai,
                    'tanggal_selesai'   => $request->tanggal_selesai,
                ]
            );

select * from `jadwal` where `jadwal`.`id` = '1' limit 1
---
    public function show($id)
    {
        $data = Jadwal::find($id);

select * from `jadwal` where `jadwal`.`id` = '4' limit 1
delete from `jadwal` where `id` = 4
---
    public function destroy($id)
    {
        $jadwal = Jadwal::find($id);
        $jadwal->delete();