app/Http/Controllers/Hrd/KaryawanController.php

select * from `jabatan` where `jabatan`.`id` in (1)
select * from `karyawan`
select * from `users` where `users`.`id` in (1, 2)
select `id`, `nama` from `jabatan`
---
    public function index()
    {

        //datatable
        if (request()->ajax()) {
            $data = Karyawan::with('user.jabatan')->get();

            return Datatables::of($data)
                ->addIndexColumn()
                ->addColumn('action', function ($row) {

                    $actionBtn = '
                            <center>
                            <a href="/hrd/karyawan/'.$row->id.'/edit" class="btn btn-sm btn-outline-info" data-toggle="tooltip" data-placement="top" title="Slip Gaji"><i class="ti-money"></i></a>
                            <a href="javascript:void(0)" class="btn btn-sm btn-outline-warning" data-toggle="tooltip" data-placement="top" title="Edit" onclick="edit(' . $row->id . ')"><i class="ti-pencil-alt"></i></a>
                            <a href="javascript:void(0)" class="btn btn-sm btn-outline-danger" data-toggle="tooltip" data-placement="top" title="Hapus" onclick="delete_data(' . $row->id . ')"><i class="ti-trash"></i></a>
                            </center>';

                    return $actionBtn;
                })
                ->rawColumns(['action'])
                ->make(true);
        }

        $jabatan    = Jabatan::select('id', 'nama')->get();

insert into `users` (`name`, `password`, `jabatan_id`, `uid`, `email`, `updated_at`, `created_at`) values ('guntur', '$2y$10$gjyjflCzo5Xtjn5FDvjvmOogwYEcH4/mKWPfb2Ekl.4ysX5B.2juO', '1', '', 'guntur@mail', '2022-04-11 02:45:03', '2022-04-11 02:45:03')
select * from `users` where `name` = 'guntur' limit 1
insert into `karyawan` (`user_id`, `nik`, `nama`, `alamat`, `no_hp`, `jenis_kelamin`, `updated_at`, `created_at`) values (2, '345', 'Guntur', 'Sukoharjo', '08573778485', 'L', '2022-04-11 02:45:03', '2022-04-11 02:45:03')
---
    public function store(Request $request)
    {

        if (!$request->id) {

            $validator = Validator::make($request->all(), [
                'nik'       => 'required',
                'nama'      => 'required',
                'no_hp'     => 'required',
                'alamat'    => 'required',
                'username'      => 'required|unique:App\Models\User,name',
                'password'  => 'required',
                'jabatan'   => 'required',
                'jenis_kelamin'   => 'required',
            ]);

            if ($validator->fails()) {
                return response()->json(['errors' => $validator->errors()]);
            }

            // add data
            DB::beginTransaction();

            try {

                User::Create([
                    'name'              => $request->username,
                    'password'          => Hash::make($request->password),
                    'jabatan_id'        => $request->jabatan,
                    'uid'               => '',
                    'email'             => $request->username . '@mail',
                ]);

                $user = User::where('name', $request->username)->first();

                Karyawan::Create([
                    'user_id'           => $user->id,
                    'nik'               => $request->nik,
                    'nama'              => $request->nama,
                    'alamat'            => $request->alamat,
                    'no_hp'             => $request->no_hp,
                    'jenis_kelamin'     => $request->jenis_kelamin,
                ]);